leetcode/38/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>38. Count and Say - enzo&#39;s note book</title>
  <meta charset="utf-8" />
  <meta name="author" content="enzo liu" />
  <meta name="description" content="leetcode" />
  <meta name="keywords" content="leetcode, ruby" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">

</head>

  <body class="container">
<header id="header">
    <body>
        <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
            <div class="container-fluid">
                <div class="navbar-header">
                    <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                        <span class="sr-only">Toggle navigation</span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                        <span class="icon-bar"></span>
                    </button>
                    <a class="navbar-brand" href="/">enzo&#39;s note book</a>
                </div>
                <div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
                    <ul class="nav navbar-nav navbar-right">
                            <li class="active"><a href="/blog/">Blog</a></li>
                            <li class="active"><a href="/history/">History</a></li>
                            <li class="active"><a href="/leetcode/">Leetcode</a></li>
                        <li><a href="/tags/">Tags</a></li>
                        <li><a href="/about/">About</a></li>
                        <li><a href="https://github.com/Enzo-Liu">GitHub</a></li>
                        <li><a href="/rss.xml">RSS</a></li>
                    </ul>
                </div>
            </div>
        </nav>
    </body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row" style="padding-top: 70px">
        <div class="col-md-2"></div>
            <h1>38. Count and Say</h1>
            
<div id="outline-container-org8e9d21c" class="outline-2">
<h2 id="org8e9d21c">题目</h2>
<div class="outline-text-2" id="text-org8e9d21c">
<p>
<a href="https://leetcode.com/problems/count-and-say/">链接</a>
</p>

<p class="verse">
The count-and-say sequence is the sequence of integers beginning as follows:<br />
1, 11, 21, 1211, 111221, ...<br />
<br />
1 is read off as "one 1" or 11.<br />
11 is read off as "two 1s" or 21.<br />
21 is read off as "one 2, then one 1" or 1211.<br />
Given an integer n, generate the nth sequence.<br />
<br />
Note: The sequence of integers will be represented as a string.<br />
</p>
</div>
</div>

<div id="outline-container-org4ee7ab3" class="outline-2">
<h2 id="org4ee7ab3">思路</h2>
<div class="outline-text-2" id="text-org4ee7ab3">
<blockquote>
<p>
一轮一轮reduce过去, 数一下个数写进去
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org692a464" class="outline-2">
<h2 id="org692a464">代码</h2>
<div class="outline-text-2" id="text-org692a464">
<div class="org-src-container">
<pre class="src src-ruby"># @param {Integer} n
# @return {String}
def count_and_say(n)
  (1..n-1).inject("1") do |res,_index|
    to_next(res)
  end
end

def to_next (str, num = 0, cur = nil, res=[])
  str.each_char do |c|
    if cur == c
      num = num + 1
    else
      res.push(num.to_s, cur) if cur != nil
      cur = c
      num = 1
    end
  end
  res.push(num.to_s,cur) if cur != nil and num != 0
  res.join
end
</pre>
</div>
</div>
</div>

    </div>
</section>


    <div class="post-meta">
        <span title="post date" class="post-info">2016-03-09</span>
        <span title="last modification date" class="post-info">2016-03-09</span>
        <span title="tags" class="post-info"><a href="/tags/leetcode/">leetcode</a>, <a href="/tags/ruby/">ruby</a></span>
        <span title="author" class="post-info">enzo liu</span>
    </div>
<footer class="footer">
    <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
    <p>
        Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:liuenze6516 &lt;at&gt; gmail &lt;dot&gt; com">enzo liu</a>
        &nbsp;&nbsp;-&nbsp;&nbsp;
        Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
        <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
    </p>
</footer>

  </body>
</html>
